%%--GaussBP（beam plot）-----------
%%--李先鹏-------------------------
%%--20190308----------------------
%%--------------------------------------------------
%由Zemax获得光轴方向截面内的光束能量密度分布数据
%计算束宽，进一步拟合获得高斯光束双曲线
%%-------------------------------------------------
%step:能量密度分布数据光轴方向步长，单位mm
%L：能量密度分布数据实际光轴方向长度，单位mm
%a:能量密度分布数据，二维矩阵
%%--------------------------------------------------
%Please load Energy Density Distribution Data first
%%--------------------------------------------------
step=input('step in [mm]=');
L=input('Length in [mm]=');
a=input('Energy Density Distribution Data a=');
beam_width(step,L,a);
createFit1(x, d);
d0=ans.d0;
theta=ans.theta;
gaussbeamplot(L,d0,theta);
%%----------------------------------------------------